In [17]:
import pandas as pd

df = pd.DataFrame({'d1':['2020-12-01', '2020-12-02'],
                   'd2':['01/12/22','02/12/22']})
df2 = df.replace('22','2022')
df.dtypes

d1    object
d2    object
dtype: object

In [42]:

# Create a pandas DataFrame.
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","2/22","Spark","Java Language","2/22","PHP Language"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

         Courses    Fee Duration
0          Spark  22000   30days
1           2/22  25000   50days
2          Spark  23000   30days
3  Java Language  24000   60days
4           2/22  26000   35days
5   PHP Language  27000   30days

In [43]:
df2 = df.replace('2/22','Python with Spark')
df2

             Courses    Fee Duration
0              Spark  22000   30days
1  Python with Spark  25000   50days
2              Spark  23000   30days
3      Java Language  24000   60days
4  Python with Spark  26000   35days
5       PHP Language  27000   30days

In [29]:
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","12/22","Spark","Java Language","12/22","PHP Language"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

         Courses    Fee Duration
0          Spark  22000   30days
1          12/22  25000   50days
2          Spark  23000   30days
3  Java Language  24000   60days
4          12/22  26000   35days
5   PHP Language  27000   30days

In [31]:
df2 = df.replace('/22','XXXX')
print(df2)

         Courses    Fee Duration
0          Spark  22000   30days
1          12/22  25000   50days
2          Spark  23000   30days
3  Java Language  24000   60days
4          12/22  26000   35days
5   PHP Language  27000   30days

In [45]:
df2['Fee'].apply(np.sqrt)

0    148.323970
1    158.113883
2    151.657509
3    154.919334
4    161.245155
5    164.316767
Name: Fee, dtype: float64